# 数据合并及分组

## 1. 数据合并

In [1]:
import datetime

In [6]:

weeks= 3500/40.0
weeks

87.5

In [8]:
import datetime
u = datetime.datetime.strptime("2022-04-03","%Y-%m-%d")
weeks = 2345.0/40.0
d = datetime.timedelta(weeks=88)
t = u + d
print(t)

2023-12-10 00:00:00

In [2]:
import pandas as pd

staff_df = pd.DataFrame([{'姓名': '张三', '部门': '研发部'},
                        {'姓名': '李四', '部门': '财务部'},
                        {'姓名': '赵六', '部门': '市场部'}])


student_df = pd.DataFrame([{'姓名': '张三', '专业': '计算机'},
                        {'姓名': '李四', '专业': '会计'},
                        {'姓名': '王五', '专业': '市场营销'}])

print(staff_df)
print(student_df)

   姓名   部门
0  张三  研发部
1  李四  财务部
2  赵六  市场部
   姓名    专业
0  张三   计算机
1  李四    会计
2  王五  市场营销

In [3]:
pd.merge(staff_df, student_df, how='outer', on='姓名')
# 或者
# staff_df.merge(student_df, how='outer', on='姓名')

   姓名   部门    专业
0  张三  研发部   计算机
1  李四  财务部    会计
2  赵六  市场部   NaN
3  王五  NaN  市场营销

In [4]:
pd.merge(staff_df, student_df, how='inner', on='姓名')
# 或者
# staff_df.merge(student_df, how='inner', on='姓名')

   姓名   部门   专业
0  张三  研发部  计算机
1  李四  财务部   会计

In [5]:
pd.merge(staff_df, student_df, how='left', on='姓名')
# 或者
# staff_df.merge(student_df, how='left', on='姓名')

   姓名   部门   专业
0  张三  研发部  计算机
1  李四  财务部   会计
2  赵六  市场部  NaN

In [6]:
pd.merge(staff_df, student_df, how='right', on='姓名')
# 或者
# staff_df.merge(student_df, how='right', on='姓名')

   姓名   部门    专业
0  张三  研发部   计算机
1  李四  财务部    会计
2  王五  NaN  市场营销

In [7]:
# 也可以按索引进行合并
staff_df.set_index('姓名', inplace=True)
student_df.set_index('姓名', inplace=True)
print(staff_df)
print(student_df)

     部门
姓名
张三  研发部
李四  财务部
赵六  市场部
      专业
姓名
张三   计算机
李四    会计
王五  市场营销

In [8]:
pd.merge(staff_df, student_df, how='left', left_index=True, right_index=True)
# 或者
# staff_df.merge(student_df, how='left', left_index=True, right_index=True)

     部门   专业
姓名
张三  研发部  计算机
李四  财务部   会计
赵六  市场部  NaN

In [9]:
# 当数据中的列名不同时，使用left_on，right_on
staff_df.reset_index(inplace=True)
student_df.reset_index(inplace=True)
print(staff_df)
print(student_df)

   姓名   部门
0  张三  研发部
1  李四  财务部
2  赵六  市场部
   姓名    专业
0  张三   计算机
1  李四    会计
2  王五  市场营销

In [10]:
staff_df.rename(columns={'姓名': '员工姓名'}, inplace=True)
student_df.rename(columns={'姓名': '学生姓名'}, inplace=True)
print(staff_df)
print(student_df)

  员工姓名   部门
0   张三  研发部
1   李四  财务部
2   赵六  市场部
  学生姓名    专业
0   张三   计算机
1   李四    会计
2   王五  市场营销

In [11]:
pd.merge(staff_df, student_df, how='left', left_on='员工姓名', right_on='学生姓名')

  员工姓名   部门 学生姓名   专业
0   张三  研发部   张三  计算机
1   李四  财务部   李四   会计
2   赵六  市场部  NaN  NaN

In [12]:
# 如果两个数据中包含有相同的列名（不是要合并的列）时，merge会自动加后缀作为区别
staff_df['地址'] = ['天津', '北京', '上海']
student_df['地址'] = ['天津', '上海', '广州']
print(staff_df)
print(student_df)

  员工姓名   部门  地址
0   张三  研发部  天津
1   李四  财务部  北京
2   赵六  市场部  上海
  学生姓名    专业  地址
0   张三   计算机  天津
1   李四    会计  上海
2   王五  市场营销  广州

In [13]:
pd.merge(staff_df, student_df, how='left', left_on='员工姓名', right_on='学生姓名')

  员工姓名   部门 地址_x 学生姓名   专业 地址_y
0   张三  研发部   天津   张三  计算机   天津
1   李四  财务部   北京   李四   会计   上海
2   赵六  市场部   上海  NaN  NaN  NaN

In [14]:
# 也可指定后缀名称
pd.merge(staff_df, student_df, how='left', left_on='员工姓名', right_on='学生姓名', suffixes=('(公司)', '(家乡)'))

  员工姓名   部门 地址(公司) 学生姓名   专业 地址(家乡)
0   张三  研发部     天津   张三  计算机     天津
1   李四  财务部     北京   李四   会计     上海
2   赵六  市场部     上海  NaN  NaN    NaN

In [15]:
# 也可以指定多列进行合并，找出同一个人的工作地址和家乡地址相同的记录
pd.merge(staff_df, student_df, how='inner', left_on=['员工姓名', '地址'], right_on=['学生姓名', '地址'])

  员工姓名   部门  地址 学生姓名   专业
0   张三  研发部  天津   张三  计算机

In [16]:
# apply使用
# 获取姓
staff_df['员工姓名'].apply(lambda x: x[0])

0    张
1    李
2    赵
Name: 员工姓名, dtype: object

In [17]:
# 获取名
staff_df['员工姓名'].apply(lambda x: x[1:])

0    三
1    四
2    六
Name: 员工姓名, dtype: object

In [18]:
# 结果合并
staff_df.loc[:, '姓'] = staff_df['员工姓名'].apply(lambda x: x[0])
staff_df.loc[:, '名'] = staff_df['员工姓名'].apply(lambda x: x[1:])
print(staff_df)

  员工姓名   部门  地址  姓  名
0   张三  研发部  天津  张  三
1   李四  财务部  北京  李  四
2   赵六  市场部  上海  赵  六

## 2. 数据分组

In [3]:
import pandas as pd

In [40]:
report_data = pd.read_csv('./国际音标.csv')
report_data

,1,太阳,～下山了,ha31no44,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7
0,2,月亮,～出来了,kun22la44,NaN,NaN,NaN,NaN
1,3,星星,NaN,l̥in44tei35,NaN,NaN,NaN,NaN
2,4,云,NaN,hau44,NaN,NaN,NaN,NaN
3,5,风,NaN,kji35,NaN,NaN,NaN,NaN
4,6,台风,NaN,（无）,NaN,NaN,NaN,NaN
5,7,闪电,名词,io31i22,NaN,NaN,NaN,NaN
6,8,雷,NaN,kuŋ35kwaŋ31,NaN,NaN,NaN,NaN
7,9,雨,NaN,luŋ44ŋa31,NaN,NaN,NaN,NaN
8,10,非常,比上条程度深：今天～热,hən22,NaN,le35suŋ31,NaN,io31i22

In [41]:
report_data.columns = ['id', 'char1', 'char2', 'Yinbiao1', 'nan1', 'Yinbiao2', 'nan2', 'Yinbiao3']

In [42]:
report_data_1 = report_data[['id', 'Yinbiao1', 'Yinbiao2', 'Yinbiao3']]
report_data_1

   id     Yinbiao1   Yinbiao2 Yinbiao3
0   2    kun22la44        NaN      NaN
1   3  l̥in44tei35        NaN      NaN
2   4        hau44        NaN      NaN
3   5        kji35        NaN      NaN
4   6          （无）        NaN      NaN
5   7      io31i22        NaN      NaN
6   8  kuŋ35kwaŋ31        NaN      NaN
7   9    luŋ44ŋa31        NaN      NaN
8  10        hən22  le35suŋ31  io31i22

In [43]:
# Step 1
# We start with creating a new dataframe from the series with EmployeeId as the index
report_data_2 = pd.DataFrame(report_data_1[['Yinbiao1', 'Yinbiao2', 'Yinbiao3']], index=report_data_1.id).stack()
report_data_2

id
2   Yinbiao1          hau44
3   Yinbiao1          kji35
4   Yinbiao1            （无）
5   Yinbiao1        io31i22
6   Yinbiao1    kuŋ35kwaŋ31
7   Yinbiao1      luŋ44ŋa31
8   Yinbiao1          hən22
    Yinbiao2      le35suŋ31
    Yinbiao3        io31i22
dtype: object

In [37]:
report_data_3 = report_data_2.reset_index(['id'])
report_data_3

          id            0
Yinbiao1   2        hau44
Yinbiao1   3        kji35
Yinbiao1   4          （无）
Yinbiao1   5      io31i22
Yinbiao1   6  kuŋ35kwaŋ31
Yinbiao1   7    luŋ44ŋa31
Yinbiao1   8        hən22
Yinbiao2   8    le35suŋ31
Yinbiao3   8      io31i22

In [72]:
report_data_3

          id      Yinbiao
Yinbiao1   2        hau44
Yinbiao1   3        kji35
Yinbiao1   4          （无）
Yinbiao1   5      io31i22
Yinbiao1   6  kuŋ35kwaŋ31
Yinbiao1   7    luŋ44ŋa31
Yinbiao1   8        hən22
Yinbiao2   8    le35suŋ31
Yinbiao3   8      io31i22

In [132]:
import re

def context_concat(row): 
    list_char = re.split('\\d+', row['Yinbiao'])[:-1]
    if len(list_char) == 0:
        return None
    else:
        list_num = re.split('\\D+', row['Yinbiao'])[1:]
        result = [None]*(len(list_char)+len(list_num))
        result[::2] = list_char
        result[1::2] = list_num
        
        s1 = ""
        for i in range(len(result)):
            s1 += result[i]
            if i < len(result) - 1:
                s1 += ','
        return s1

In [133]:
report_data_3['target'] = report_data_3.apply(lambda row: context_concat(row), axis=1)
report_data_4 = report_data_3['target'].reset_index()

In [134]:
report_data_4

      index          target
0  Yinbiao1          hau,44
1  Yinbiao1          kji,35
2  Yinbiao1            None
3  Yinbiao1      io,31,i,22
4  Yinbiao1  kuŋ,35,kwaŋ,31
5  Yinbiao1    luŋ,44,ŋa,31
6  Yinbiao1          hən,22
7  Yinbiao2    le,35,suŋ,31
8  Yinbiao3      io,31,i,22

In [115]:
for index, row in report_data_4.iterrows():
            print(str(row['target']))

['hau', '44']
['kji', '35']
None
['io', '31', 'i', '22']
['kuŋ', '35', 'kwaŋ', '31']
['luŋ', '44', 'ŋa', '31']
['hən', '22']
['le', '35', 'suŋ', '31']
['io', '31', 'i', '22']

In [135]:
open?

In [120]:
# mode addition and mode write, Escape character of a new line
file = open('name_copy.txt', 'a')
file.write("\n")
file.write("Zozoroa Solo")
file.close()

In [149]:
report_data_5 = report_data_4.dropna(subset=['target'])

In [150]:
report_data_5

      index          target
0  Yinbiao1          hau,44
1  Yinbiao1          kji,35
3  Yinbiao1      io,31,i,22
4  Yinbiao1  kuŋ,35,kwaŋ,31
5  Yinbiao1    luŋ,44,ŋa,31
6  Yinbiao1          hən,22
7  Yinbiao2    le,35,suŋ,31
8  Yinbiao3      io,31,i,22

In [172]:
import csv
with open('output.csv', "w", encoding='utf-16') as csv_file:
        writer = csv.writer(csv_file, quoting=csv.QUOTE_ALL)
        for index, row in report_data_5.iterrows():
            print(row['target'])
            for s in row['target'].split(','):
                print(s)
                writer.writerow([s])

hau,44
hau
44
kji,35
kji
35
io,31,i,22
io
31
i
22
kuŋ,35,kwaŋ,31
kuŋ
35
kwaŋ
31
luŋ,44,ŋa,31
luŋ
44
ŋa
31
hən,22
hən
22
le,35,suŋ,31
le
35
suŋ
31
io,31,i,22
io
31
i
22

In [153]:
import csv
with open('output.csv', "w", encoding='utf-16') as csv_file:
        writer = csv.writer(csv_file)
        for index, row in report_data_5.iterrows():
            print(row['target'])
            l_s = row['target'].split(',')
            print(l_s)
            columns_map={'column1':''}
            for i in range(len(l_s)):
                key = 'column' + str((i + 1))
                columns_map[key] = l_s[i]
            print(columns_map)
            writer.writerow(columns_map)

hau,44
['hau', '44']
{'column1': 'hau', 'column2': '44'}
kji,35
['kji', '35']
{'column1': 'kji', 'column2': '35'}
io,31,i,22
['io', '31', 'i', '22']
{'column1': 'io', 'column2': '31', 'column3': 'i', 'column4': '22'}
kuŋ,35,kwaŋ,31
['kuŋ', '35', 'kwaŋ', '31']
{'column1': 'kuŋ', 'column2': '35', 'column3': 'kwaŋ', 'column4': '31'}
luŋ,44,ŋa,31
['luŋ', '44', 'ŋa', '31']
{'column1': 'luŋ', 'column2': '44', 'column3': 'ŋa', 'column4': '31'}
hən,22
['hən', '22']
{'column1': 'hən', 'column2': '22'}
le,35,suŋ,31
['le', '35', 'suŋ', '31']
{'column1': 'le', 'column2': '35', 'column3': 'suŋ', 'column4': '31'}
io,31,i,22
['io', '31', 'i', '22']
{'column1': 'io', 'column2': '31', 'column3': 'i', 'column4': '22'}

In [113]:
report_data_5.to_csv(path='output3.csv', sep=",", encoding='utf-16')

C:\tools\ds\Anaconda3\envs\py3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: The signature of `Series.to_csv` was aligned to that of `DataFrame.to_csv`, and argument 'path' will be renamed to 'path_or_buf'.
  """Entry point for launching an IPython kernel.
C:\tools\ds\Anaconda3\envs\py3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: The signature of `Series.to_csv` was aligned to that of `DataFrame.to_csv`, and argument 'header' will change its default value from False to True: please pass an explicit value to suppress this warning.
  """Entry point for launching an IPython kernel.

In [ ]:
report_data_3['target'].to_csv

In [59]:
import re
re.split('\\d+', 'hello world')

['hello world']

In [67]:
re.split('\\d+', 'kuŋ35kwaŋ31')[:-1]

['kuŋ', 'kwaŋ']

In [68]:
re.split('\\D+', 'kuŋ35kwaŋ31')[1:]

['35', '31']

In [53]:
re.split('\W+', 'test, test, test.')

['test', 'test', 'test', '']

In [45]:
report_data_3.columns = ['id', 'Yinbiao']
report_data_3

          id      Yinbiao
Yinbiao1   2        hau44
Yinbiao1   3        kji35
Yinbiao1   4          （无）
Yinbiao1   5      io31i22
Yinbiao1   6  kuŋ35kwaŋ31
Yinbiao1   7    luŋ44ŋa31
Yinbiao1   8        hən22
Yinbiao2   8    le35suŋ31
Yinbiao3   8      io31i22

In [33]:
report_data_2.index

MultiIndex([(2, 'Yinbiao1'),
            (3, 'Yinbiao1'),
            (4, 'Yinbiao1'),
            (5, 'Yinbiao1'),
            (6, 'Yinbiao1'),
            (7, 'Yinbiao1'),
            (8, 'Yinbiao1'),
            (8, 'Yinbiao2'),
            (8, 'Yinbiao3')],
           names=['id', None])

In [19]:
# Step 1
# We start with creating a new dataframe from the series with EmployeeId as the index
new_df = pd.DataFrame(df.City.str.split('|').tolist(), index=df.EmployeeId).stack()
new_df

EmployeeId
001         0       Mumbai
            1    Bangalore
002         0         Pune
            1       Mumbai
            2        Delhi
003         0       Mumbai
            1    Bangalore
004         0       Mumbai
            1         Pune
005         0    Bangalore
dtype: object

In [26]:
new_df.index

RangeIndex(start=0, stop=10, step=1)

In [20]:
# Step 2
# We now want to get rid of the secondary index
# To do this, we will make EmployeeId as a column (it can't be an index since the values will be duplicate)
new_df = new_df.reset_index([0, 'EmployeeId'])
new_df

  EmployeeId          0
0        001     Mumbai
1        001  Bangalore
2        002       Pune
3        002     Mumbai
4        002      Delhi
5        003     Mumbai
6        003  Bangalore
7        004     Mumbai
8        004       Pune
9        005  Bangalore

In [ ]:
# Step 3
# The final step is to set the column names as we want them
new_df.columns = ['EmployeeId', 'City']

In [25]:
report_data_2.index

MultiIndex([(0,       'id'),
            (0, 'Yinbiao1'),
            (1,       'id'),
            (1, 'Yinbiao1'),
            (2,       'id'),
            (2, 'Yinbiao1'),
            (3,       'id'),
            (3, 'Yinbiao1'),
            (4,       'id'),
            (4, 'Yinbiao1'),
            (5,       'id'),
            (5, 'Yinbiao1'),
            (6,       'id'),
            (6, 'Yinbiao1'),
            (7,       'id'),
            (7, 'Yinbiao1'),
            (8,       'id'),
            (8, 'Yinbiao1'),
            (8, 'Yinbiao2'),
            (8, 'Yinbiao3')],
           )

In [ ]:
# Explode/Split column into multiple rows
new_df = pd.DataFrame(report_data_1.City.str.split('|').tolist(), index=df.EmployeeId).stack()
new_df = new_df.reset_index([0, 'EmployeeId'])
new_df.columns = ['EmployeeId', 'City']

In [14]:
report_data['label'] = report_data.apply(lambda row: row['Amount'] == "Yes", axis=1)

In [21]:
report_data['Amounts'] = report_data.apply(lambda row: row['Amount'][1:], axis=1)

In [22]:
report_data['Amounts'] = report_data['Amounts'].astype(float)

In [23]:
report_data.head()

,Date,Description,Amount,Type,label,Amounts
0,"Oct 28, 2019",VIDEOTRON LTEE. 110 PPACCMONTREAL QC,$133.79,Telcome,False,133.79
1,"Oct 24, 2019",DUTY FREE MTL INT'L ST-LAURENT QC,$43.00,One-time,False,43.00
2,"Oct 19, 2019",PAYPAL *GOOGLE LONG TE 4029357733 NS,$30.99,Game,False,30.99
3,"Oct 14, 2019",PAYPAL *GOOGLE LONG TE 4029357733 NS,$24.99,Game,False,24.99
4,"Oct 14, 2019",PAYPAL *GOOGLE LONG TE 4029357733 NS,$30.99,Game,False,30.99

In [24]:
grouped = report_data.groupby('Type')

In [25]:
grouped['Amounts'].sum()

Type
Game         161.11
Meet          14.79
One-time      43.00
Social        14.09
Telcome      492.15
Transport    141.00
Travel        23.00
Name: Amounts, dtype: float64

In [19]:
report_data = pd.read_csv('./2015.csv')
report_data.head()

,Country,Region,Happiness Rank,Happiness Score,Standard Error,Economy (GDP per Capita),Family,Health (Life Expectancy),Freedom,Trust (Government Corruption),Generosity,Dystopia Residual
0,Switzerland,Western Europe,1,7.587,0.03411,1.39651,1.34951,0.94143,0.66557,0.41978,0.29678,2.51738
1,Iceland,Western Europe,2,7.561,0.04884,1.30232,1.40223,0.94784,0.62877,0.14145,0.43630,2.70201
2,Denmark,Western Europe,3,7.527,0.03328,1.32548,1.36058,0.87464,0.64938,0.48357,0.34139,2.49204
3,Norway,Western Europe,4,7.522,0.03880,1.45900,1.33095,0.88521,0.66973,0.36503,0.34699,2.46531
4,Canada,North America,5,7.427,0.03553,1.32629,1.32261,0.90563,0.63297,0.32957,0.45811,2.45176

In [20]:
#groupby()
grouped = report_data.groupby('Region')

In [21]:
grouped['Happiness Score'].mean()

Region
Australia and New Zealand          7.285000
Central and Eastern Europe         5.332931
Eastern Asia                       5.626167
Latin America and Caribbean        6.144682
Middle East and Northern Africa    5.406900
North America                      7.273000
Southeastern Asia                  5.317444
Southern Asia                      4.580857
Sub-Saharan Africa                 4.202800
Western Europe                     6.689619
Name: Happiness Score, dtype: float64

In [22]:
size_by_group = grouped.size()
size_by_group

Region
Australia and New Zealand           2
Central and Eastern Europe         29
Eastern Asia                        6
Latin America and Caribbean        22
Middle East and Northern Africa    20
North America                       2
Southeastern Asia                   9
Southern Asia                       7
Sub-Saharan Africa                 40
Western Europe                     21
dtype: int64

In [ ]:
type(size_by_group)

In [ ]:
size_by_group_sort = size_by_group.sort_values(ascending=False).reset_index().reset_index()
size_by_group_sort['count'] = size_by_group_sort[0]
size_by_group_sort

In [ ]:
size_by_group_sort.reset_index()
size_by_group_sort.index

In [ ]:
size_by_group_sort.reset_index().reset_index()
size_by_group_sort.index

In [ ]:
size_by_group_sort = size_by_group.sort_index

In [ ]:
size_by_group_sort = size_by_group.sort_index

In [ ]:
# 迭代groupby对象
for group, frame in grouped: 
    mean_score = frame['Happiness Score'].mean()
    max_score = frame['Happiness Score'].max()
    min_score = frame['Happiness Score'].min()
    print('{}地区的平均幸福指数：{}，最高幸福指数：{}，最低幸福指数{}'.format(group, mean_score, max_score, min_score))

In [ ]:
# 自定义函数进行分组
# 按照幸福指数排名进行划分，1-10, 10-20, >20
# 如果自定义函数，操作针对的是index
report_data2 = report_data.set_index('Happiness Rank')

def get_rank_group(rank):
    rank_group = ''
    if rank <= 10:
        rank_group = '0 -- 10'
    elif rank <= 20:
        rank_group = '10 -- 20'
    else:
        rank_group = '> 20'
    return rank_group

grouped = report_data2.groupby(get_rank_group)
for group, frame in grouped:
    print('{}分组的数据个数：{}'.format(group, len(frame)))

grouped.size()

In [ ]:
# 实际项目中，通常可以先人为构造出一个分组列，然后再进行groupby

# 按照score的整数部分进行分组
# 按照幸福指数排名进行划分，1-10, 10-20, >20
# 如果自定义函数，操作针对的是index
report_data['score group'] = report_data['Happiness Score'].apply(lambda score: int(score))

grouped = report_data.groupby('score group')
for group, frame in grouped:
    print('幸福指数整数部分为{}的分组数据个数：{}'.format(group, len(frame)))

grouped.size()

In [ ]:
import numpy as np

grouped.agg({'Happiness Score': np.mean, 'Happiness Rank': np.max})

In [ ]:
grouped['Happiness Score'].agg(func)